# ViewDisplaySketchyLines Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDisplaySketchyLines Properties
ViewDisplaySketchyLines Class See Also
---
The ViewDisplaySketchyLines type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EnableSketchyLines | True to enable sketchy lines visibility. False to disable it. |
| Extension | The extension scale value. Controls the magnitude of line's extension. Values between 0 and 10. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Jitter | The jitter defines jitteriness of the line. Values between 0 and 10. |

# See Also
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace